# Напишите программу для объединения следующих словарей для создания нового
# Исходные словари :
# dic1={1:10, 2:20}
# dic2={3:30, 4:40}
# dic3={5:50,6:60}
# Результат : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50,6:60}

final_dic = dic1 | dic2 | dic3

print(final_dic)
