# Напишите программу, которая копирует список

import copy

my_list = [1, 2, 3, [4, 5, 6], 7, 8, "hello"]

print(list)

copy_list = copy.deepcopy(list)

print(copy_list)
